In [1]:
"""It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
"""

'It happens all the time: someone gives you data containing malformed strings,\nPython, lists and missing data. How do you tidy it up so you can get on with the\nanalysis?\nTake this monstrosity as the DataFrame to use in the following puzzles:\ndf = pd.DataFrame({\'From_To\': [\'LoNDon_paris\', \'MAdrid_miLAN\',\n\'londON_StockhOlm\',\n\n\'Budapest_PaRis\', \'Brussels_londOn\'],\n\'FlightNumber\': [10045, np.nan, 10065, np.nan, 10085],\n\'RecentDelays\': [[23, 47], [], [24, 43, 87], [13], [67, 32]],\n\'Airline\': [\'KLM(!)\', \'<Air France> (12)\', \'(British Airways. )\',\n\'12. Air France\', \'"Swiss Air"\']})\n'

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [4]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [5]:
"""1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).
"""

'1. Some values in the the FlightNumber column are missing. These numbers are\nmeant to increase by 10 with each row so 10055 and 10075 need to be put in\nplace. Fill in these missing numbers and make the column an integer column\n(instead of a float column).\n'

In [6]:
df.describe(),df.dtypes,df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  3 non-null      float64
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: float64(1), object(3)
memory usage: 288.0+ bytes

(       FlightNumber
 count           3.0
 mean        10065.0
 std            20.0
 min         10045.0
 25%         10055.0
 50%         10065.0
 75%         10075.0
 max         10085.0,
 From_To          object
 FlightNumber    float64
 RecentDelays     object
 Airline          object
 dtype: object,
 None)

In [7]:
df['FlightNumber']=df['FlightNumber'].interpolate().astype(int)

In [8]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [9]:
"""2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame."""

'2. The From_To column would be better as two separate columns! Split each\nstring on the underscore delimiter _ to give a new temporary DataFrame with\nthe correct values. Assign the correct column names to this temporary\nDataFrame.'

In [10]:
#del df1
 
df1= df.From_To.str.split("_",expand=True)

df1.columns=['From','To']
df1

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [11]:
"""3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)"""

'3. Notice how the capitalisation of the city names is all mixed up in this\ntemporary DataFrame. Standardise the strings so that only the first letter is\nuppercase (e.g. "londON" should become "London".)'

In [12]:
df1.From=df1['From'].str.title()
df1.To=df1['To'].str.title()
df1

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [13]:
"""4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions."""

'4. Delete the From_To column from df and attach the temporary DataFrame\nfrom the previous questions.'

In [14]:
df=df.drop(['From_To'],axis=1)
df=pd.concat([df1,df],axis=1)
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

In [15]:
"""5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays."""

"5. In the RecentDelays column, the values have been entered into the\nDataFrame as a list. We would like each first value in its own column, each\n\nsecond value in its own column, and so on. If there isn't an Nth value, the value\nshould be NaN.\nExpand the Series of lists into a DataFrame named delays, rename the columns\ndelay_1, delay_2, etc. and replace the unwanted RecentDelays column in df\nwith delays."

In [16]:
df2=df
df2[["delay_1","delay_2","delay_3"]]=pd.DataFrame(df2.pop('RecentDelays').to_list(),index=df2.index)
df2

,From,To,FlightNumber,Airline,delay_1,delay_2,delay_3
0,London,Paris,10045,KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055,<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065,(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075,12. Air France,13.0,NaN,NaN
4,Brussels,London,10085,"""Swiss Air""",67.0,32.0,NaN